#include <string>
#include <iostream>
#include "输出彩色支持.h"
#include "工具合集.h"
#include "词法分析器.h"

using std::string;

// 神经但可爱的东西...
string 喵de语录[] = {
	"[刘小黑]为什么要把我放在这个方括号里呢",
	"[刘小黑]LXH写代码累坏了唉",
	"[刘小黑]感谢你愿意收养本喵在你的电脑里！",
	"[刘小黑]Github仓库里好黑...闷死本喵了",
	"[刘小黑]哈哈，这是本喵的2.0！",
	"[刘小黑]Deep Seek给LXH立大功...",
	"[刘小黑]话说main是什么意思呢？不懂唉",
};

void 基本界面() {
	输出文本("+——————————————————————————","青");
	输出文本("Luxaohi—中文编程语言解释器");
	输出文本("[刘小黑]"+ 获取系统用户名() + "泥嚎！");
	输出文本("喵de语录：" + 喵de语录[生成随机数(0, 6)]);
	输出文本("+——————————————————————————","青");
}

string 输入() {
	// 输入
	输出文本("(>ω<) ","BB",false);
	string 输入;
	std::getline(std::cin, 输入);

	if (std::cin.eof()) {
		return "EOF";
	}

	return 输入;
}

void 退出() {
	输出文本("[刘小黑]唔...先退出了嗷", "YY");
	exit(0);
}

bool 简单分析行(string& 行) {
	if (行 == "") return 0;
	else if (行 == "EOF") 退出();
	return 1;
}

void 交互与执行() {
	基本界面();
	while (1) {
		string 行;
		行 = 输入();
		if (简单分析行(行)) { 
			词法分析器类 分析实例(行);
			std::vector<词法分析器类::令牌> 令牌列表 = 分析实例.分析();
		}
	}
}